
SELECT * FROM user;
SELECT * FROM book;
SELECT * FROM borrowingRecord;
SELECT * FROM inventory;


INSERT INTO book (ISBN, Name, Author, Introduction)
VALUES 
('978-986-16-3359-2', '小王子', '安東尼·德·聖修伯里', '講述一位來自外星的小王子在不同星球旅行的寓言故事，充滿哲理。'),
('978-957-13-5128-8', '解憂雜貨店', '東野圭吾', '一部關於一間雜貨店，通過書信與人們解答疑惑的溫暖故事。'),
('978-986-06-7890-4', '富爸爸窮爸爸', '羅伯特·清崎', '一本探討財富、投資與個人成長的經典財務書籍。'),
('978-957-33-3301-1', '紅樓夢', '曹雪芹', '一部中國古典小說，描寫賈寶玉與林黛玉、薛寶釵的愛情故事及賈氏家族的興衰。'),
('978-957-13-6355-7', '射鵰英雄傳', '金庸', '一部武俠小說，講述郭靖在江湖中的成長與冒險，並最終成為民族英雄。'),
('978-957-14-3578-2', '三國演義', '羅貫中', '中國四大名著之一，描述三國時期群雄逐鹿的歷史故事。'),
('978-957-32-4567-9', '西遊記', '吳承恩', '描述唐僧師徒四人西天取經途中遇到的各種磨難與冒險。'),
('978-957-08-6589-0', '水滸傳', '施耐庵', '描述108位英雄好漢聚義梁山，反抗腐敗政府的故事。'),
('978-986-12-7894-1', '鹿鼎記', '金庸', '講述韋小寶在清朝康熙年間的冒險和江湖恩怨。'),
('978-986-67-8987-5', '狼圖騰', '姜戎', '一部關於蒙古草原和狼性文化的小說，探討人與自然的關係。');

INSERT INTO Inventory (ISBN, StoreTime, Status)
VALUES
('978-957-33-3301-1', '2023-01-10 10:15:00', '可借閱'),
('978-957-13-6355-7', '2023-02-14 14:30:00', '已借閱'),
('978-957-14-3578-2', '2023-03-01 09:45:00', '已借閱'),
('978-957-32-4567-9', '2023-03-21 11:00:00', '可借閱'),
('978-957-08-6589-0', '2023-04-12 08:20:00', '可借閱'),
('978-986-12-7894-1', '2023-05-08 15:10:00', '可借閱'),
('978-986-16-3359-2', '2023-06-19 13:25:00', '可借閱'),
('978-957-13-5128-8', '2023-07-22 16:40:00', '已借閱'),
('978-986-06-7890-4', '2023-08-01 12:00:00', '可借閱'),
('978-986-67-8987-5', '2023-08-15 17:30:00', '已借閱');






